## TF Plan for app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 13 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.app will be created
  + resource "aws_acm_certificate" "app" {
      + arn                       = (known after apply)
      + domain_name               = "app.learning-resources.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "app.learning-resources.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "Environment" = "staging"
        }
      + tags_all                  = {
          + "Environment" = "staging"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_apigatewayv2_api.app will be created
  + resource "aws_apigatewayv2_api" "app" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Proxy to handle requests to our learning app lambda"
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "learning-gateway"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # aws_apigatewayv2_api_mapping.app will be created
  + resource "aws_apigatewayv2_api_mapping" "app" {
      + api_id      = (known after apply)
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # aws_apigatewayv2_deployment.app will be created
  + resource "aws_apigatewayv2_deployment" "app" {
      + api_id        = (known after apply)
      + auto_deployed = (known after apply)
      + description   = "App deployment"
      + id            = (known after apply)
    }

  # aws_apigatewayv2_domain_name.app will be created
  + resource "aws_apigatewayv2_domain_name" "app" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "app.learning-resources.cdssandbox.xyz"
      + id                               = (known after apply)
      + tags_all                         = (known after apply)

      + domain_name_configuration {
          + certificate_arn    = (known after apply)
          + endpoint_type      = "REGIONAL"
          + hosted_zone_id     = (known after apply)
          + security_policy    = "TLS_1_2"
          + target_domain_name = (known after apply)
        }
    }

  # aws_apigatewayv2_integration.app will be created
  + resource "aws_apigatewayv2_integration" "app" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Learning app lambda integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.app will be created
  + resource "aws_apigatewayv2_route" "app" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.app will be created
  + resource "aws_apigatewayv2_stage" "app" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = false
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)
    }

  # aws_ecr_repository.learning_resources will be created
  + resource "aws_ecr_repository" "learning_resources" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "learning-resources/learning-frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_role.app will be created
  + resource "aws_iam_role" "app" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "learning-resources-app"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.AWSLambdaVPCAccessExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaVPCAccessExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "learning-resources-app"
    }

  # aws_lambda_function.learning_resources will be created
  + resource "aws_lambda_function" "learning_resources" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "learning-frontend"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "contentful_cda_access_token" = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "learning-frontend"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowLambdaInvoke"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_api.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_domain_name.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_stage.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.learning_resources"]

15 tests, 8 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
